In [100]:
#Importing Pandas as pd
import pandas as pd

## Task 1 : Setup and DataFrame Creation

In [101]:
#Creating dataframe from a dictionary
dictionary_1 = {
    'Name' : ['Justin', 'Henry', 'Ram', 'JK'],
    'Age' : [30, 45, 8, 27]
}
dictionary_1

{'Name': ['Justin', 'Henry', 'Ram', 'JK'], 'Age': [30, 45, 8, 27]}

In [102]:
df_1 = pd.DataFrame(dictionary_1)
df_1

     Name  Age
0  Justin   30
1   Henry   45
2     Ram    8
3      JK   27

In [103]:
#Creating dataframe from a list of dictionaries
dictionary_2 = [{
        'Name' : 'Ram',
        'Age' : 28,
        'Gender' : 'Male'
    },
    {
        'Name' : 'Sita',
        'Age' : 27,
        'Gender' : 'Female'
    }
]
dictionary_2

[{'Name': 'Ram', 'Age': 28, 'Gender': 'Male'},
 {'Name': 'Sita', 'Age': 27, 'Gender': 'Female'}]

In [104]:
df_2 = pd.DataFrame(dictionary_2)
df_2

   Name  Age  Gender
0   Ram   28    Male
1  Sita   27  Female

In [105]:
#Load a dataset from a CSV file that is provide called messed_dataset.csv
# df_3 = pd.read_csv('messed_dataset.csv')
df_3 = pd.read_csv(r'messed_dataset.csv')
df_3

,Name,Age,Email,Country,Salary,DateOfJoining
0,invalid,59.0,ycastro@example.org,Switzerland,44694.24,2022-09-29
1,David Jefferson,21.0,NaN,China,NaN,2021-10-04
2,Jessica Reyes,34.0,NaN,NaN,60511.62,2022-05-24
3,Kenneth Macdonald,68.0,ewolf@example.com,Italy,84223.29,2022-04-07
4,Julie Horne,78.0,NaN,Ecuador,24665.13,2020-06-19
...,...,...,...,...,...,...
95,Garrett Davidson,56.0,gjames@example.com,Solomon Islands,86227.88,NaN
96,Elizabeth Ross,52.0,richardlewis@example.net,Equatorial Guinea,29992.69,2020-04-08
97,NaN,72.0,brian50@example.com,Somalia,90628.22,2020-04-11
98,Patricia Singh,65.0,lramirez@example.org,Greece,85290.44,2020-03-18
99,Christopher Stokes,42.0,NaN,South Africa,20289.17,2021-09-23

# Task 2 : Viewing and Inspecting Data

In [106]:
#Display the first and last few rows of the DataFrame.
#Displaying first few rows
print(df_3.head())

                Name   Age                Email      Country    Salary  \
0            invalid  59.0  ycastro@example.org  Switzerland  44694.24
1    David Jefferson  21.0                  NaN        China       NaN
2      Jessica Reyes  34.0                  NaN          NaN  60511.62
3  Kenneth Macdonald  68.0    ewolf@example.com        Italy  84223.29
4        Julie Horne  78.0                  NaN      Ecuador  24665.13

  DateOfJoining
0    2022-09-29
1    2021-10-04
2    2022-05-24
3    2022-04-07
4    2020-06-19

In [107]:
#Displaying first 3 rows
print(df_3.head(3))

              Name   Age                Email      Country    Salary  \
0          invalid  59.0  ycastro@example.org  Switzerland  44694.24
1  David Jefferson  21.0                  NaN        China       NaN
2    Jessica Reyes  34.0                  NaN          NaN  60511.62

  DateOfJoining
0    2022-09-29
1    2021-10-04
2    2022-05-24

In [108]:
#Displaying last few rows
print(df_3.tail())

                  Name   Age                     Email            Country  \
95    Garrett Davidson  56.0        gjames@example.com    Solomon Islands
96      Elizabeth Ross  52.0  richardlewis@example.net  Equatorial Guinea
97                 NaN  72.0       brian50@example.com            Somalia
98      Patricia Singh  65.0      lramirez@example.org             Greece
99  Christopher Stokes  42.0                       NaN       South Africa

      Salary DateOfJoining
95  86227.88           NaN
96  29992.69    2020-04-08
97  90628.22    2020-04-11
98  85290.44    2020-03-18
99  20289.17    2021-09-23

In [109]:
#Displaying first 10 rows
print(df_3.head(10))

                Name   Age                      Email      Country    Salary  \
0            invalid  59.0        ycastro@example.org  Switzerland  44694.24
1    David Jefferson  21.0                        NaN        China       NaN
2      Jessica Reyes  34.0                        NaN          NaN  60511.62
3  Kenneth Macdonald  68.0          ewolf@example.com        Italy  84223.29
4        Julie Horne  78.0                        NaN      Ecuador  24665.13
5   Jonathan Holland  26.0   mayercaitlin@example.org     Cameroon  25660.99
6        James Clark  80.0        ynguyen@example.net          NaN  61345.33
7   Kimberly Roberts  76.0        lmiller@example.org  Netherlands  58550.56
8  Barbara Armstrong  22.0      fmitchell@example.com          NaN       NaN
9        Jason Perez  59.0  collinsedward@example.com      Myanmar  20175.11

  DateOfJoining
0    2022-09-29
1    2021-10-04
2    2022-05-24
3    2022-04-07
4    2020-06-19
5    2023-05-01
6           NaN
7    2023-07-08
8           NaN
9    2024-04-11

In [110]:
#Get a summary of the DataFrame, including basic statistics and data types
df_3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Name           89 non-null     object
 1   Age            97 non-null     object
 2   Email          80 non-null     object
 3   Country        86 non-null     object
 4   Salary         94 non-null     object
 5   DateOfJoining  79 non-null     object
dtypes: object(6)
memory usage: 4.8+ KB

In [111]:
#Display the shape and column names of the DataFrame.
df_3.describe()

           Name   Age                Email Country   Salary DateOfJoining
count        89    97                   80      86       94            79
unique       85    53                   80      76       93            79
top     invalid  76.0  ycastro@example.org   China  invalid    2022-09-29
freq          5     6                    1       2        2             1

# Task 3 : Selection and Indexing

In [112]:
#Select a single column and multiple columns.
#Selecting single column
df_3['Name']

0                invalid
1        David Jefferson
2          Jessica Reyes
3      Kenneth Macdonald
4            Julie Horne
             ...
95      Garrett Davidson
96        Elizabeth Ross
97                   NaN
98        Patricia Singh
99    Christopher Stokes
Name: Name, Length: 100, dtype: object

In [113]:
#Selecting multiple columns
df_3[['Name','Age','Country']]

                  Name   Age            Country
0              invalid  59.0        Switzerland
1      David Jefferson  21.0              China
2        Jessica Reyes  34.0                NaN
3    Kenneth Macdonald  68.0              Italy
4          Julie Horne  78.0            Ecuador
..                 ...   ...                ...
95    Garrett Davidson  56.0    Solomon Islands
96      Elizabeth Ross  52.0  Equatorial Guinea
97                 NaN  72.0            Somalia
98      Patricia Singh  65.0             Greece
99  Christopher Stokes  42.0       South Africa

[100 rows x 3 columns]

In [114]:
#Select rows by index and columns by label.
#Selecting rows by index
df_3.iloc[0]

Name                         invalid
Age                             59.0
Email            ycastro@example.org
Country                  Switzerland
Salary                      44694.24
DateOfJoining             2022-09-29
Name: 0, dtype: object

In [115]:
#Select specific rows and columns using loc and iloc.
#Using loc
df_3.loc[1, 'Name']

'David Jefferson'

In [116]:
#Specific columns and rows
df_3.loc[0:2,['Name','Age']]

              Name   Age
0          invalid  59.0
1  David Jefferson  21.0
2    Jessica Reyes  34.0

In [117]:
df_3.iloc[1:4]

                Name   Age              Email Country    Salary DateOfJoining
1    David Jefferson  21.0                NaN   China       NaN    2021-10-04
2      Jessica Reyes  34.0                NaN     NaN  60511.62    2022-05-24
3  Kenneth Macdonald  68.0  ewolf@example.com   Italy  84223.29    2022-04-07

# Task 4: Handling Missing Data

In [118]:
#Identify missing values in the DataFrame.
df_3.isnull().sum()

Name             11
Age               3
Email            20
Country          14
Salary            6
DateOfJoining    21
dtype: int64

In [119]:
#Fill missing values with a specified value.
#Filling 'None' to missing values of Name
df_3.fillna(value = {"Name" : "None"},inplace = True)

In [120]:
#Checking the missing values again after Name field is filled
df_3.isnull().sum()

Name              0
Age               3
Email            20
Country          14
Salary            6
DateOfJoining    21
dtype: int64

In [121]:
#Drop rows with missing values.
df_3.dropna(inplace = True)

In [122]:
#Checking after dropping the missing values
df_3.isnull().sum()

Name             0
Age              0
Email            0
Country          0
Salary           0
DateOfJoining    0
dtype: int64

# Task 5 : Data Operations

In [123]:
#Using previous df
df_1

     Name  Age
0  Justin   30
1   Henry   45
2     Ram    8
3      JK   27

In [124]:
#Add a new column to the DataFrame.
df_1['Salary'] = [20000, 5000, 10000, 33000]
df_1

     Name  Age  Salary
0  Justin   30   20000
1   Henry   45    5000
2     Ram    8   10000
3      JK   27   33000

In [125]:
#Delete a column from the DataFrame.
df_1.drop(columns = ['Age'], inplace=True)
df_1

     Name  Salary
0  Justin   20000
1   Henry    5000
2     Ram   10000
3      JK   33000

In [126]:
#Rename columns in the DataFrame.
df_1.rename(columns ={'Salary' : 'Monthly Salary'}, inplace=True)
df_1

     Name  Monthly Salary
0  Justin           20000
1   Henry            5000
2     Ram           10000
3      JK           33000

In [127]:
#Apply a function to a column.
#Add 10000 to all monthly salary
df_1['Monthly Salary']=df_1['Monthly Salary'].apply(lambda x : x + 10000)
df_1

     Name  Monthly Salary
0  Justin           30000
1   Henry           15000
2     Ram           20000
3      JK           43000

# Task 6: GroupBy Operations

In [128]:
#Group the DataFrame by a column and calculate summary statistics.
data = {
    'Name' : ['Ram','Sita','Sameer','Ram'],
    'Age' : [26, 29, 30, 21],
    'Score' : [86, 78, 90, 95]
}
data

{'Name': ['Ram', 'Sita', 'Sameer', 'Ram'],
 'Age': [26, 29, 30, 21],
 'Score': [86, 78, 90, 95]}

In [129]:
df = pd.DataFrame(data)
df

     Name  Age  Score
0     Ram   26     86
1    Sita   29     78
2  Sameer   30     90
3     Ram   21     95

In [130]:
#GroupBy Name
grouped = df.groupby('Name')
grouped

In [131]:
#Calculate the mean
mean_score = grouped['Score'].mean()
mean_score

Name
Ram       90.5
Sameer    90.0
Sita      78.0
Name: Score, dtype: float64

In [132]:
#Iterate over groups and display the group names and data.
for name, data in grouped:
    print(f"Group Name: {name}")
    print(data)
    print()

Group Name: Ram
  Name  Age  Score
0  Ram   26     86
3  Ram   21     95

Group Name: Sameer
     Name  Age  Score
2  Sameer   30     90

Group Name: Sita
   Name  Age  Score
1  Sita   29     78

# Task 7: Merging and Joining DataFrames

In [133]:
#Join two DataFrames using their indices.
df1 = pd.DataFrame({
    'Name' : ['Ram', 'Shyam', 'Hari'],
    'Address' : ['Patan', 'Ktm', 'Pkr']
}, index = ['01', '02', '03'])
df1

     Name Address
01    Ram   Patan
02  Shyam     Ktm
03   Hari     Pkr

In [134]:
df2 = pd.DataFrame({
    'Surnames' : ['Shakya', 'Johnson', 'Kim'],
    'Department' : ['IT', 'Business', 'Arts']
}, index = ['01', '02', '03'])
df2

   Surnames Department
01   Shakya         IT
02  Johnson   Business
03      Kim       Arts

In [135]:
joined_df = df1.join(df2)
joined_df

     Name Address Surnames Department
01    Ram   Patan   Shakya         IT
02  Shyam     Ktm  Johnson   Business
03   Hari     Pkr      Kim       Arts

In [136]:
#Merge two DataFrames on a common column.
df1 = pd.DataFrame({
    'ID' : ['01', '02', '03'],
    'Address' : ['Patan', 'Ktm', 'Pkr']
})
df1

   ID Address
0  01   Patan
1  02     Ktm
2  03     Pkr

In [137]:
df2 = pd.DataFrame({
    'ID' : ['01', '02', '03'],
    'Name' : ['Jake', 'Robert', 'Nisha']
})
df2

   ID    Name
0  01    Jake
1  02  Robert
2  03   Nisha

In [138]:
merged_df = pd.merge(df1, df2, on='ID')
merged_df

   ID Address    Name
0  01   Patan    Jake
1  02     Ktm  Robert
2  03     Pkr   Nisha

# Task 8: Working with Dates and Times

In [139]:
#Create a datetime index for the DataFrame and Convert a column to datetime and extract date components.
df['Date'] = pd.date_range(start = '1/1/2024', periods = len(df), freq='M')
df

C:\Users\ASUS\AppData\Local\Temp\ipykernel_18888\1013586384.py:2: FutureWarning: 'M' is deprecated and will be removed in a future version, please use 'ME' instead.
  df['Date'] = pd.date_range(start = '1/1/2024', periods = len(df), freq='M')

     Name  Age  Score       Date
0     Ram   26     86 2024-01-31
1    Sita   29     78 2024-02-29
2  Sameer   30     90 2024-03-31
3     Ram   21     95 2024-04-30

In [140]:
#Converting to datetime
df['Date'] = pd.to_datetime(df['Date'])
df

     Name  Age  Score       Date
0     Ram   26     86 2024-01-31
1    Sita   29     78 2024-02-29
2  Sameer   30     90 2024-03-31
3     Ram   21     95 2024-04-30

In [141]:
#Extracting date components
df['Year'] = df['Date'].dt.year
df['Month'] = df['Date'].dt.month
df['Day'] = df['Date'].dt.day
df

     Name  Age  Score       Date  Year  Month  Day
0     Ram   26     86 2024-01-31  2024      1   31
1    Sita   29     78 2024-02-29  2024      2   29
2  Sameer   30     90 2024-03-31  2024      3   31
3     Ram   21     95 2024-04-30  2024      4   30

In [142]:
#Setting the index to datetime
df.set_index('Date', inplace=True)
df

              Name  Age  Score  Year  Month  Day
Date
2024-01-31     Ram   26     86  2024      1   31
2024-02-29    Sita   29     78  2024      2   29
2024-03-31  Sameer   30     90  2024      3   31
2024-04-30     Ram   21     95  2024      4   30

# Task 9: Input and Output

In [143]:
#Read data from a CSV file into a DataFrame.
data_read_csv = pd.read_csv(r"messed_dataset.csv")
data_read_csv

,Name,Age,Email,Country,Salary,DateOfJoining
0,invalid,59.0,ycastro@example.org,Switzerland,44694.24,2022-09-29
1,David Jefferson,21.0,NaN,China,NaN,2021-10-04
2,Jessica Reyes,34.0,NaN,NaN,60511.62,2022-05-24
3,Kenneth Macdonald,68.0,ewolf@example.com,Italy,84223.29,2022-04-07
4,Julie Horne,78.0,NaN,Ecuador,24665.13,2020-06-19
...,...,...,...,...,...,...
95,Garrett Davidson,56.0,gjames@example.com,Solomon Islands,86227.88,NaN
96,Elizabeth Ross,52.0,richardlewis@example.net,Equatorial Guinea,29992.69,2020-04-08
97,NaN,72.0,brian50@example.com,Somalia,90628.22,2020-04-11
98,Patricia Singh,65.0,lramirez@example.org,Greece,85290.44,2020-03-18
99,Christopher Stokes,42.0,NaN,South Africa,20289.17,2021-09-23

In [144]:
#Write the DataFrame to a CSV file.
df.to_csv('newfile.csv', index = False)

In [145]:
#Read data from an Excel file into a DataFrame. The data given is SaleData.xlsx.
data_read_excel = pd.read_excel(r"C:\Users\ASUS\Desktop\AI Course\data-science-assignment-2-AngelaShakya\SaleData.xlsx")
data_read_excel

ImportError: Missing optional dependency 'openpyxl'.  Use pip or conda to install openpyxl.

In [ ]:
#Write the DataFrame to an Excel file.
df.to_excel('newfile.xlsx', index = False)

ModuleNotFoundError: No module named 'openpyxl'

# Task 10: Visualization
- Visualize the data by using the visualization libraries

In [ ]:
import matplotlib.pyplot as plt
#Impoting matplotlib
import seaborn as sns
#importing seaborn

In [ ]:
#Change later 
data_read_excel = pd.read_excel(r"SaleData.xlsx")
data_read_excel

NameError: name 'pd' is not defined

In [ ]:
#Creating a simple plot using Matplotlib
#Reading the two columns
units = data_read_excel['Units']
unit_price = data_read_excel['Unit_price']

In [ ]:
#Line Plot
plt.plot(units,unit_price)
plt.xlabel("Units")
plt.ylabel("Unit_price")
plt.title("Simple plot using Matplotlib")
plt.show()

In [ ]:
#Scatter Plot
plt.scatter(units,unit_price)
plt.xlabel("Units")
plt.ylabel("Unit_price")
plt.title("Scatter plot using Matplotlib")
plt.show()

In [ ]:
#Creating a bar plot using Seaborn
#Getting info of data
data_read_excel.info()

In [ ]:
#Bar Plot using seaborn
sns.barplot(x= "Unit_price", y ="Sale_amt", data=data_read_excel)
plt.title("Bar Plot using seaborn")
plt.show()